In [1]:
import pandas as pd

insert

In [3]:
ser = {
    'a': pd.Series([1,2,3,4,5]),
    'b': pd.Series([10,20,30,40,50])
}

In [4]:
df = pd.DataFrame(data=ser)

In [5]:
df

   a   b
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [8]:
df.insert(1, 'new', [100,200,300,400,500])

In [9]:
df

   a  new   b
0  1  100  10
1  2  200  20
2  3  300  30
3  4  400  40
4  5  500  50

In [11]:
df.insert(0,'dublicate_a', df['a'])

In [12]:
df

   dublicate_a  a  new   b
0            1  1  100  10
1            2  2  200  20
2            3  3  300  30
3            4  4  400  40
4            5  5  500  50

In [16]:
df['new_1_3'] = df['new'][1:3]

In [17]:
df

   dublicate_a  a  new   b  new_1_3
0            1  1  100  10      NaN
1            2  2  200  20    200.0
2            3  3  300  30    300.0
3            4  4  400  40      NaN
4            5  5  500  50      NaN

Delete

In [18]:
df.pop('dublicate_a')

0    1
1    2
2    3
3    4
4    5
Name: dublicate_a, dtype: int64

In [19]:
df

   a  new   b  new_1_3
0  1  100  10      NaN
1  2  200  20    200.0
2  3  300  30    300.0
3  4  400  40      NaN
4  5  500  50      NaN

In [20]:
del df['a']

In [21]:
df

   new   b  new_1_3
0  100  10      NaN
1  200  20    200.0
2  300  30    300.0
3  400  40      NaN
4  500  50      NaN